app/controllers/traces_controller.rb

INSERT INTO "traces" ("latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["latitude", 32.9377784729004], ["longitude", -117.230392456055], ["created_at", "2017-12-02 18:37:52.965260"], ["updated_at", "2017-12-02 18:37:52.965260"]]
---
	def create
		@statuses = []
  	if params["_json"]
	  	params["_json"].each do |trace_params|
	  		params.permit!
	  		@trace = Trace.create!(trace_params)

UPDATE "traces" SET "longitude" = ?, "updated_at" = ? WHERE "traces"."id" = ?  [["longitude", -555.230392456055], ["updated_at", "2017-12-03 11:47:45.527215"], ["id", 3]]
---
  def update
  	@trace.update(trace_params)

DELETE FROM "traces" WHERE "traces"."id" = ?  [["id", 1]]
---
  def destroy
  	@trace.destroy

SELECT  "traces".* FROM "traces" WHERE "traces"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
		def set_trace
			@trace = Trace.find(params[:id])